laazizi/robotandme/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# Tick FreeRTOS a 1 kHz pour un timing de boucle de controle precis
CONFIG_FREERTOS_HZ=1000

# Le transport micro-ROS est choisi par profil :
#   sdkconfig.serial (defaut) ou sdkconfig.eth — voir scripts/build.*
